# LinePatternSegment Class

---
Represents a segment in a line pattern.
SystemObject Autodesk.Revit.DBLinePatternSegment
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LinePatternSegment : IDisposable

    Public Class LinePatternSegment
    	Implements IDisposable

    public ref class LinePatternSegment : IDisposable

    type LinePatternSegment =
        class
            interface IDisposable
        end
The LinePatternSegment type exposes the following members.
| Name| Description
---|---|---
| LinePatternSegment|  Creates a line pattern segment.
| LinePatternSegment(LinePatternSegmentType, Double)|  Creates a line pattern segment with given type and length.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Length|  Gets and sets the length of the segment.
| Type|  Gets and sets the type of the segment.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the LinePatternSegment
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace